---
kind: type
id: T:Autodesk.Revit.DB.Analysis.FieldDomainPointsByParameter
source: html/6fbc455e-bb1d-b812-ccb1-c49dbcb15d74.htm
---
# Autodesk.Revit.DB.Analysis.FieldDomainPointsByParameter

Represents a set of one-dimensional point coordinates (defined usually on curve)

## Syntax (C#)
```csharp
public class FieldDomainPointsByParameter : FieldDomainPoints
```